Процедура УстановитьИдентификаторЧата(Логин, ИдЧата) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сотрудники.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|	Сотрудники.Телеграм_Логин = &Логин
		|	И Сотрудники.Телеграм_ИдЧата = 0
		|	И НЕ Сотрудники.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Логин", Логин);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл

		СправочникОбъект = Выборка.Ссылка.ПолучитьОбъект();
		СправочникОбъект.Телеграм_ИдЧата = ИдЧата;
		
		СправочникОбъект.Записать();
		
	КонецЦикла;

КонецПроцедуры

Функция ПолучитьСотрудникаПоЛогинуТелеграм(Логин) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сотрудники.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|	Сотрудники.Телеграм_Логин = &Телеграм_Логин
		|	И НЕ Сотрудники.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Телеграм_Логин", Логин);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
	
		Возврат Выборка.Ссылка;	
	
	КонецЕсли;
	
КонецФункции // ПолучитьСотрудникаПоЛогинуТелеграм()
