Процедура ПередатьИдентификаторПодписчикаУведомлений(ИдентификаторПодписчикаУведомлений, ТекстОшибки) Экспорт
	
	СтарыйИдентификатор = Константы.ИдентификаторПодписчикаУведомлений.Получить().Получить();
	
	Если СтарыйИдентификатор <> ИдентификаторПодписчикаУведомлений Тогда

		ИдХранилище = Новый ХранилищеЗначения(ИдентификаторПодписчикаУведомлений);
		Константы.ИдентификаторПодписчикаУведомлений.Установить(ИдХранилище);
		
		URL = Константы.АдресСервера.Получить() + "/UpdateSubscriberId";
		
		Данные = Новый Структура;
		
		Данные.Вставить("ТранспортноеСредство", Константы.ТекущееТранспортноеСредство.Получить().УникальныйИдентификатор());
		Данные.Вставить("ИдентификаторУстройства", XMLСтрока(ИдХранилище));
		
		Ответ = КоннекторHTTP.Post(URL, Данные);	
		
		Если Ответ.КодСостояния <> 200 Тогда
			Сообщить("Ошибка отправки идентификатора подписчика: " + Ответ.КодСостояния);
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры