Процедура ПередатьИдентификаторПодписчикаУведомлений(ИдентификаторПодписчикаУведомлений, ТекстОшибки) Экспорт
	
	СтарыйИдентификатор = Константы.ИдентификаторПодписчикаУведомлений.Получить().Получить();
	
	Если СтарыйИдентификатор <> ИдентификаторПодписчикаУведомлений Тогда
		Прокси = Обмен.ПолучитьПрокси(ТекстОшибки);
		
		Если Прокси = Неопределено Тогда
			ВызватьИсключение ТекстОшибки;
		КонецЕсли;
		
		Узел = ПланыОбмена.МобильныеУстройства.ЭтотУзел();
		Сериализатор = Новый СериализаторXDTO(Прокси.ФабрикаXDTO);
		ИдентификаторXDTO = Сериализатор.ЗаписатьXDTO(ИдентификаторПодписчикаУведомлений);
		Прокси.НовыйИдентификаторПодписчикаУведомлений(Узел.Код, ИдентификаторXDTO);
		
		Константы.ИдентификаторПодписчикаУведомлений.Установить(Новый ХранилищеЗначения(ИдентификаторПодписчикаУведомлений));
		
	КонецЕсли;
	
КонецПроцедуры