Процедура ОбновитьИдентификаторУстройства(ПараметрыЗапроса) Экспорт

	ИмяСправочника = "ТранспортныеСредства";
	
	Ссылка = ОбщегоНазначения.ПолучитьСсылкуПоУИД(ИмяСправочника, ПараметрыЗапроса.ТранспортноеСредство);

	Если НЕ ЗначениеЗаполнено(Ссылка.ВерсияДанных) Тогда
		Возврат;
	КонецЕсли;
	
	СправочникОбъект = Ссылка.ПолучитьОбъект();
	
	СправочникОбъект.ИдентификаторУстройства = XMLЗначение(Тип("ХранилищеЗначения"), ПараметрыЗапроса.ИдентификаторУстройства);
	
	СправочникОбъект.ОбменДанными.Загрузка = Истина;
	СправочникОбъект.Записать();

КонецПроцедуры
