
Процедура ПриНачалеРаботыСистемы()
	
	#Если МобильноеПриложениеКлиент Тогда
		
		// Push- и локальные уведомления
		// идентификатор подписчика надо получать регулярно, он может измениться.
		УведомленияКлиент.ОбновитьИдентификаторПодписчикаУведомлений();
	
		// Подключение обработчика локальных и push-уведомлений.
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаУведомлений", УведомленияКлиент);
		ДоставляемыеУведомления.ПодключитьОбработчикУведомлений(ОписаниеОповещения);	
		
	#КонецЕсли
	
КонецПроцедуры
