
Процедура ПриНачалеРаботыСистемы()
	
	ПодключитьОбработчикОповещения("ОбработчикОповещения");
	
КонецПроцедуры

Процедура ОбработчикОповещения(ИмяСобытия, Параметр, Источник) Экспорт
	
	Если ИмяСобытия = "ИзмененияДляОбмена" Тогда
		Обмен.ВыполнитьСинхронизациюВФоне();
		//Если Обмен.ВыполнитьСинхронизацию() Тогда
		//	ПоказатьПредупреждение(, "Синхронизация данных завершена.", 5);
		//	ОповеститьОбИзменении(Тип("РегистрСведенийКлючЗаписи.ИсторияЧата"));
		//	//ОповеститьОбИзменении(Тип("ДокументСсылка.ОбслуживаниеЗаказов"));
		//	//ОповеститьОбИзменении(Тип("СправочникСсылка.ХранимыеФайлы"));
		//Иначе
		//	//ПоказатьПредупреждение(, ТекстОшибки);
		//КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры