#Если НЕ МобильноеПриложениеСервер Тогда
Процедура ОтправитьУведомление(Уведомление, Пользователь) Экспорт
	
	Выборка = ПланыОбмена.МобильныеУстройства.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ЭтотУзел Тогда
			Продолжить;
		КонецЕсли;
		
		Если Выборка.ИдентификаторПодписчикаДоставляемыхУведомлений.Получить() = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если Пользователь = Неопределено ИЛИ Пользователь = Выборка.ТранспортноеСредство Тогда
			Идентификатор = Выборка.ИдентификаторПодписчикаДоставляемыхУведомлений.Получить();
			Если Идентификатор <> Неопределено Тогда
				Уведомление.Получатели.Добавить(Идентификатор);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Уведомление.Получатели.Количество() > 0 Тогда
		ДанныеАутентификации = "";
		Сертификат = Неопределено;
		ДанныеАутентификации = СокрЛП(Константы.КлючДоступаОтправителя.Получить());
		УдаленныеТокены = Новый Массив;
		Попытка
			ОтправкаДоставляемыхУведомлений.Отправить(
				Уведомление, ДанныеАутентификации, УдаленныеТокены, Истина);
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
		НеИспользоватьИдентификаторы(УдаленныеТокены);
	КонецЕсли;
	
КонецПроцедуры

Процедура НеИспользоватьИдентификаторы(Токены)
	
	Если Токены.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = ПланыОбмена.МобильныеУстройства.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ИдентификаторПодписчикаДоставляемыхУведомлений = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Идентификатор = Выборка.ИдентификаторПодписчикаДоставляемыхУведомлений.Получить();
		Если Идентификатор <> Неопределено И
			Токены.Найти(Идентификатор.ИдентификаторУстройства) Тогда
			Узел = Выборка.ПолучитьОбъект();
			Узел.ИдентификаторПодписчикаДоставляемыхУведомлений = Неопределено;
			Узел.Записать();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли