#Если НЕ МобильноеПриложениеСервер Тогда
	
Процедура ОтправитьУведомление(Уведомление, Идентификатор, СообщениеЧата) Экспорт
	
	Если Идентификатор = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	Уведомление.Получатели.Добавить(Идентификатор);
	
	Если НЕ Уведомление.Получатели.Количество() Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеАутентификации = "";
	Сертификат = Неопределено;
	ДанныеАутентификации = СокрЛП(Константы.КлючДоступаОтправителя.Получить());
	УдаленныеТокены = Новый Массив;
	
	Попытка
		ОтправкаДоставляемыхУведомлений.Отправить(Уведомление, ДанныеАутентификации, УдаленныеТокены, Истина);
	Исключение
		ЗаписьЖурналаРегистрации("Отправка PUSH уведомлений", УровеньЖурналаРегистрации.Ошибка, , СообщениеЧата, ОписаниеОшибки());
	КонецПопытки;
	
	НеИспользоватьИдентификаторы(УдаленныеТокены);
	
КонецПроцедуры

Процедура НеИспользоватьИдентификаторы(Токены)
	
	Если Токены.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТранспортныеСредства.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ТранспортныеСредства КАК ТранспортныеСредства
		|ГДЕ
		|	ТранспортныеСредства.ИдентификаторУстройства В(&УдаленныеТокены)";
	
	Запрос.УстановитьПараметр("УдаленныеТокены", Токены);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка = ПланыОбмена.МобильныеУстройства.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Узел = Выборка.ПолучитьОбъект();
		Узел.ИдентификаторУстройства = "";
		Узел.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли