Процедура ОбновитьИдентификаторПодписчикаУведомлений() Экспорт
	
	#Если МобильноеПриложениеКлиент Тогда
		
		Попытка
			ИдентификаторПодписчикаУведомлений = ДоставляемыеУведомления.ПолучитьИдентификаторПодписчикаУведомлений();
			ТекстОшибки = "";
			УведомленияСервер.ПередатьИдентификаторПодписчикаУведомлений(ИдентификаторПодписчикаУведомлений, ТекстОшибки);
			Если ТекстОшибки <> "" Тогда
				Сообщить(ТекстОшибки);
			КонецЕсли;
		Исключение
			Инфо = ИнформацияОбОшибке();
			ПоказатьИнформациюОбОшибке(Инфо);
		КонецПопытки;
		
	#КонецЕсли
	
КонецПроцедуры

Процедура ОбработкаУведомлений(Уведомление, Локальное, Показано, Параметры) Экспорт
	
	Если Не Показано Тогда
		ПослеЗакрытияНовогоСообщения = Новый ОписаниеОповещения("ПослеЗакрытияНовогоСообщения", ЭтотОбъект);
		ПоказатьПредупреждение(ПослеЗакрытияНовогоСообщения, Уведомление.Текст, , "Получено новое сообщение");
	КонецЕсли;
	
	// TODO: реализовать отправку сообщения в Данные Уведомления, после получения отображать вопрос Ответить?
	
КонецПроцедуры

Процедура ПослеЗакрытияНовогоСообщения(ПараметрыОповещения) Экспорт
	
	ОповеститьОбИзменении(Тип("СправочникСсылка.СообщенияЧата"));
	
КонецПроцедуры
