Функция ПолучитьВыборкуСотрудниковПоТранспортномуСредству(ТранспортноеСредство) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗакрепленныеСотрудникиСрезПоследних.Сотрудник КАК Сотрудник,
		|	ЗакрепленныеСотрудникиСрезПоследних.Сотрудник.Телеграм_ИдЧата КАК ИдЧата
		|ИЗ
		|	РегистрСведений.ЗакрепленныеСотрудники.СрезПоследних(
		|			,
		|			ТранспортноеСредство = &ТранспортноеСредство
		|				И Сотрудник.Телеграм_ИдЧата <> 0) КАК ЗакрепленныеСотрудникиСрезПоследних";
	
	Запрос.УстановитьПараметр("ТранспортноеСредство", ТранспортноеСредство);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выбрать();
	
КонецФункции // ПолучитьСотрудниковПоТранспортномуСредству()

Функция ПолучитьТранспортноеСредствоСотрудника(Сотрудник) Экспорт 

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗакрепленныеСотрудникиСрезПоследних.ТранспортноеСредство КАК ТранспортноеСредство
		|ИЗ
		|	РегистрСведений.ЗакрепленныеСотрудники.СрезПоследних(, Сотрудник = &Сотрудник) КАК ЗакрепленныеСотрудникиСрезПоследних";
	
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
	
		Возврат Выборка.ТранспортноеСредство;	
	
	КонецЕсли; 
	
КонецФункции // ()
