Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ТекстСообщения = СокрЛП(ТекстСообщения);
	
	Если ЭтоНовый() Тогда
		ДатаСоздания = ТекущаяДатаСеанса();
		Наименование = ТекстСообщения;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	#Если НЕ МобильноеПриложениеСервер Тогда
		
		Если ОбменДанными.Загрузка И Не ЗначениеЗаполнено(Телеграм_ИдСообщения) Тогда
			
			ВыборкаАдресатов = РегистрыСведений.ЗакрепленныеСотрудники.ПолучитьВыборкуСотрудниковПоТранспортномуСредству(ТранспортноеСредство);

			Пока ВыборкаАдресатов.Следующий() Цикл
			
				ТекстСообщенияТелеграм = "" + ТранспортноеСредство + ": " + ТекстСообщения;
				Telegram.ОтправитьСообщение(ВыборкаАдресатов.ИдЧата, ТекстСообщенияТелеграм, Ссылка);			
			
			КонецЦикла;
			
		Иначе
			
			Уведомление = Новый ДоставляемоеУведомление();
			Уведомление.Текст = "" + Автор + ": " + Лев(ТекстСообщения, 25);
			
			ИдентификаторПолучателя = ТранспортноеСредство.ИдентификаторУстройства.Получить();
			РаботаСДоставляемымиУведомлениями.ОтправитьУведомление(Уведомление, ИдентификаторПолучателя, Ссылка);
			
		КонецЕсли;
		
	#КонецЕсли	
	
КонецПроцедуры
